questions = [
    {
        "question": "Где бы вы хотели жить?",
        "options": [
            {"text": "В густом лесу, в уединении", "weights": {"lynx": 2}},
            {"text": "В бескрайних глубинах океана", "weights": {"octopus": 2}},
            {"text": "В лесу, на каком-нибудь красивом дереве", "weights": {"owl": 2}},
            {"text": "На ферме", "weights": {"rabbit": 2}},
            {"text": "Неподалёку от речки или озера", "weights": {"racoon": 2}},
            {"text": "На большой белой льдине, в отличной кампании", "weights": {"largha": 2}}
        ]
    },
    {
        "question": "Какое хобби вам подходит больше всего?",
        "options": [
            {"text": "Долгие одиночные прогулки по территории", "weights": {"lynx": 2}},
            {"text": "Изучение морских глубин", "weights": {"octopus": 2}},
            {"text": "Ночная охота", "weights": {"owl": 2}},
            {"text": "Прогулки на свежем воздухе", "weights": {"rabbit": 2}},
            {"text": "Стирка, мелкие шалости и приключения", "weights": {"racoon": 2}},
            {"text": "Плавание в ледяной воде", "weights": {"largha": 2}}
        ]
    },
    {
        "question": "Что вас больше всего мотивирует?",
        "options": [
            {"text": "Свобода и независимость", "weights": {"lynx": 2}},
            {"text": "Тяга к изучению всего нового", "weights": {"octopus": 2}},
            {"text": "Ночная охота", "weights": {"owl": 2}},
            {"text": "Семья и дети", "weights": {"rabbit": 2}},
            {"text": "Шалости и веселье", "weights": {"racoon": 2}},
            {"text": "Проводить время в окружении друзей", "weights": {"largha": 2}}
        ]
    },
    {
        "question": "Какой у вас характер?",
        "options": [
            {"text": "Независимый и сильный", "weights": {"lynx": 2}},
            {"text": "Загадочный", "weights": {"octopus": 2}},
            {"text": "Спокойный и мудрый", "weights": {"owl": 2}},
            {"text": "Добрый и нежный", "weights": {"rabbit": 2}},
            {"text": "Игривый и любопытный", "weights": {"racoon": 2}},
            {"text": "Дружелюбный и компанейский", "weights": {"largha": 2}}
        ]
    },
    {
        "question": "Какая еда вам больше нравится?",
        "options": [
            {"text": "Свежепойманное мясо", "weights": {"lynx": 2}},
            {"text": "Моллюски, раки", "weights": {"octopus": 2}},
            {"text": "Крольчатинка, мелкие грызуны", "weights": {"owl": 2}},
            {"text": "Трава, овощи, сено", "weights": {"rabbit": 2}},
            {"text": "Ягоды, орехи, рыба, яйца", "weights": {"racoon": 2}},
            {"text": "Жирная рыба", "weights": {"largha": 2}}
        ]
    },
    {
        "question": "Какое качество вы больше всего цените в окружающих?",
        "options": [
            {"text": "Верность и умение быть ненавязчивыми", "weights": {"lynx": 2}},
            {"text": "Умение понимать без слов и уважать личную территорию", "weights": {"octopus": 2}},
            {"text": "Мудрость и интеллект", "weights": {"owl": 2}},
            {"text": "Душевная теплота и нежность", "weights": {"rabbit": 2}},
            {"text": "Тяга к приключениям", "weights": {"racoon": 2}},
            {"text": "Дружелюбие", "weights": {"largha": 2}}
        ]
    },
    {
        "question": "Чем бы вы предпочли заняться в свободное время?",
        "options": [
            {"text": "Буду патрулировать свою территорию и наслаждаться тишиной", "weights": {"lynx": 2}},
            {"text": "Заберусь в древнюю амфору и обустроюсь в ней как следует", "weights": {"octopus": 2}},
            {"text": "Сяду на ветку дерева и буду смотреть, как мир просыпается", "weights": {"owl": 2}},
            {"text": "Проведу время с семьёй, будем играть и греться на солнышке", "weights": {"rabbit": 2}},
            {"text": "Пойду к водоёму и побуду с родными", "weights": {"racoon": 2}},
            {"text": "Поплаваю в ледяной воде и устрою долгую сиесту", "weights": {"largha": 2}}
        ]
    }
]